Repository: Acidburn0zzz/dmg2dir
Catalog: po/*.po
Languages: fr

source: (error %i).
fr: (erreur %i).

source: Usage: %s [OPTIONS] dmg_file.dmg
fr: Usage : %s [OPTIONS] fichier_dmg.dmg

source: -n, --name Custom name for application directory
fr: -n, --name Nom personnalisé du répertoire de l'application

source: -p, --path Custom path for application directory
fr: -p, --path Chemin personnalisé pour le répertoire de l'application

source: -t, --tmp Custom temporary directory
fr: -t, --tmp Répertoire temporaire personnalisé

source: -r, --run Attempt to run extracted application (using Darling)
fr: -r, --run Tente d'exécuter l'application extraite (en utilisant Darling)

source: -i, --iso Generate an ISO file from IMG file (using Genisoimage)
fr: -i, --iso Génère un fichier ISO à partir du fichier IMG (n utilisant Genisoimage)

source: -d, --iso-only Same as --iso, without creating application directory
fr: -d, --iso-only Comme --iso, sans créer le répertoire de l'application

source: -q, --quiet Be silent
fr: -q, --quiet S'exécute silencieusement

source: -v, --verbose Be verbose (-vv for very verbose)
fr: -v, --verbose S'exécute verbeusement (-vv pour très verbeux)

source: -V, --version Display script version and exit
fr: -V, --version Affiche la version du script et quitte

source: -h, --help Display this help and exit
fr: -h, --help Affiche cette aide et quitte

source: --overwrite-img Overwrite existing IMG file
fr: --overwrite-img Écrase le fichier IMG existant

source: --overwrite-dir Overwrite existing application directory
fr: --overwrite-img Écrase le répertoire de l'application existant

source: --overwrite-iso Overwrite existing ISO file
fr: --overwrite-img Écrase le fichier ISO existant

source: Please report issues here: %s.
fr: Merci de rapporter les problèmes ici : %s.

source: Dependency %s is required
fr: La dépendance %s est requise

source: File %s doesn't exist
fr: Le fichier %s n'existe pas

source: Variable is empty
fr: La variable est vide

source: Directory %s doesn't exist
fr: Le répertoire %s n'existe pas

source: Directory %s is empty
fr: Le répertoire %s est vide

source: Command fails
fr: La commande a échouée

source: Converting %s to %s
fr: Conversion de %s en %s

source: Setting up loop device for file %s
fr: Mise en place du périphérique loop pour le fichier %s

source: Retrieving loop device name
fr: Récupération du nom du périphérique loop

source: Mounting loop device partition %s
fr: Montage de la partition %s du périphérique loop

source: Creating virtual tree %s
fr: Création de l'arbre virtuel %s

source: Copying files from %s to application directory
fr: Copie les fichiers depuis %s vers le répertoire de l'application

source: Generating ISO file from virtual tree %s
fr: Génération du fichier ISO à partir de l'arbre virtuel %s

source: Unmounting loop device partition %s
fr: Démontage de la partition %s du périphérique loop

source: Deleting loop device %s
fr: Suppression du périphérique loop %s

source: Searching for executable in application directory
fr: Recherche un exécutable dans le répertoire de l'application

source: Found file %s, launch it with dyld
fr: Fichier %s trouvé, lancement avec dyld

source: Failed parsing options
fr: Échec lors de l'analyse des options

source: Internal error
fr: Erreur interne

source: Checking prerequisites...
fr: Vérification des pré-requis...

source: Setting variables...
fr: Prépare des variables...

source: Directory %s already exists. Use --overwrite-dir to overwrite it
fr: Le répertoire %s existe déjà. Utilisez --overwrite-dir pour l'écraser

source: File %s already exists. Use --overwrite-iso to overwrite it
fr: Le fichier %s existe déjà. Utilisez --overwrite-iso pour l'écraser

source: Making temporary working directories...
fr: Création des répertoires de travail temporaires...

source: Converting DMG file to an IMG file...
fr: Conversion du fichier DMG en un fichier IMG...

source: File %s already exists. Skipping conversion. Use --overwrite-img to overwrite it.
fr: Le fichier %s existe déjà. Saute la conversion. Utilisez --overwrite-img pour l'écraser.

source: Setting loop device...
fr: Prépare le périphérique loop...

source: Extracting files to %s...
fr: Extraction des fichiers vers %s...

source: Creating ISO file %s...
fr: Création du fichier ISO %s...

source: Cleaning...
fr: Nettoyage...

source: Trying to run extracted application with Darling...
fr: Essaye d'exécuter le fichier binaire avec Darling...
